// NOTE: This is an implementation of the SMPS playback system based on the 
// Sonic 2 Z80 disassembly by Xenowhirl.
//	-- The PAL flag timing adjustment is also missing (basically "double update"
//	   every 6 frames on a PAL system; doesn't apply to any non-TV platform)

#include <stdio.h>
#include <malloc.h>
#include <memory.h>
#include <string.h>
#include <assert.h>
#include "types.h"
#include "smps.h"

#ifndef GENESIS_MEGADRIVE
	// These are defined in system-specific sound.c:
	void DACPlay(u8 note);						// Plays a DAC sound (not using YM2612 DAC emulation)
	void DACStop();								// Stops DAC output (not using YM2612 DAC emulation)
	void ym2612_fm0_regdata(u8 reg, u8 data);	// Use to write to 0x[A0]4000 and then 0x[A0]4001 (or DAC if reg == 0x2A)
	void ym2612_fm1_regdata(u8 reg, u8 data);	// Use to write to 0x[A0]4002 and then 0x[A0]4003
	void sn76496_write(u8 data);				// Use to write to 0xC00011/0x7F11
	void StartSignal(void);
	void StopSignal(void);
	void LoopStartSignal(void);
	void LoopEndSignal(void);
#else
	// Genesis/Megadrive actually has the hardware!

	// We must actually wait for FM busy on hardware:
	inlinefunc void FMBusyWait() { while(*((volatile u8 *)0xA04000) & 0x80) {} }

	inlinefunc void DACPlay(u8 note) { note; }
	inlinefunc void DACStop() { }
	inlinefunc void ym2612_fm0_regdata(u8 reg, u8 data) { FMBusyWait(); *((volatile u8 *)0xA04000) = reg; FMBusyWait(); *((volatile u8 *)0xA04001) = data; }
	inlinefunc void ym2612_fm1_regdata(u8 reg, u8 data) { FMBusyWait(); *((volatile u8 *)0xA04002) = reg; FMBusyWait(); *((volatile u8 *)0xA04003) = data; }
	inlinefunc void sn76496_write(u8 data) { *((volatile u8 *)0xC00011) = data; }
	inlinefunc void StartSignal(void) { }
	inlinefunc void StopSignal(void) { }
	inlinefunc void LoopStartSignal(void) { }
	inlinefunc void LoopEndSignal(void) { }
#endif

extern unsigned char VGM_IgnoreWrt;

typedef const u8 voice[25];			// Quick typedef for FM voices, always 25 bytes wide

enum SMODE_PTRS
{
	PTR_68K = 0x00,
	PTR_Z80 = 0x01
};
enum SMODE_CFLAGS
{
	CFLAG_S12 = 0x00,
	CFLAG_S3K = 0x01,
	CFLAG_TRS = 0x02	// SMPS 68k Treasure
};
enum SMODE_TEMPO_CLOCK
{
	TCLK_S1 = 0x00,
	TCLK_S2 = 0x01,
	TCLK_S3K = 0x02
};
enum SMODE_INS_MODE
{
	INS_STD = 0x00,
	INS_S2 = 0x01
};
struct smps_settings
{
	u8  ptr_mode;
	u8  ins_mode;
	u8  tempo_mode;
	u8  coord_mode;
	u16 offset;
};

// Coordination flags
enum COORD_FLAGS
{
	CF_START	= 0xE0,		// Where coordination flags begin
	CF_PANAMSFMS= CF_START,	// Panning, AMS, FMS
	CF_FREQADJ,				// Alter note frequency
	CF_FADEIN_S3,			// Okay, so here's the lowdown -- in Sonic 1 & 2, this sets an arbitrary value for no known purpose.  In Sonic 3, this value, if set as FF, is used as the fade-in routine
	CF_RETURN,				// Return from CF_GOSUB (S1/S2 ONLY)
	CF_FADEIN,				// Fade-in to previous song (S1/S2 ONLY); put on DAC channel
	CF_SETTEMPODIV,			// Set this track's tempo divider
	CF_CHANGEVOLUME,		// Changes track volume
	CF_NOATTACK,			// Prevent next note from attacking
	CF_SETNOTEFILL,			// Set note fill amount to byte
	CF_TRANSPOSE,			// Add transposition to channel key (S1/S2 ONLY)
	CF_SETTEMPO,			// Change song tempo to unsigned byte
	CF_SETTEMPODIVS,		// Set ALL per-track tempo dividers
	CF_CHANGEVOLUME_LATER,	// Like CF_CHANGEVOLUME, except for FM tracks, volume change does not occur until next voice change
	CF_UNUSED_ED,			// Nothing
	CF_UNUSED_EE,			// Nothing
	CF_CHANGE_VOICE,		// Change FM voice (NOT PSG tone!)
	CF_MODULATION,			// Setup modulation
	CF_MODULATIONON,		// Turn on modulation
	CF_STOPTRACK,			// Stops this track from playing (non-looping BGMs only)
	CF_PSGSETNOISE,			// Set current PSG noise (effects noise channel only)
	CF_MODULATIONOFF,		// Turn off modulation
	CF_CHANGE_PSGTONE,		// Change PSG tone (NOT FM voice!)
	CF_JUMP,				// Jump to offset
	CF_REPEAT,				// Repeat section of music
	CF_GOSUB,				// Jump to offset, but keep return address in memory
	CF_RETURN_S3,			// Return from CF_GOSUB (S3/S&K/3K ONLY)
	CF_UNUSED_FA,			// Nothing
	CF_TRANSPOSE_S3,		// Add transposition to channel key (S3/S&K/3K ONLY)
};


// This more or less reflects the track layout of the Z80
// (which starts at $1B98)
enum TRACK_INDICES
{
	// RAS: Do NOT change the order of these unless you fix 
	// the GET_COOR_* macros!!

	TRACK_DAC,			// Music DAC track
	TRACK_FM1,			// Music FM Channel 1 track
	TRACK_FM2,			// Music FM Channel 2 track
	TRACK_FM3,			// Music FM Channel 3 track
	TRACK_FM4,			// Music FM Channel 4 track
	TRACK_FM5,			// Music FM Channel 5 track
	TRACK_FM6,			// Music FM Channel 6 track
	TRACK_PSG1,			// Music PSG Channel 1 track
	TRACK_PSG2,			// Music PSG Channel 2 track
	TRACK_PSG3,			// Music PSG Channel 3 track

	MUSIC_TRACK_TOTAL,

	TRACK_SFX_FM3 = MUSIC_TRACK_TOTAL,		// SFX FM Channel 3 track
	TRACK_SFX_FM4,		// SFX FM Channel 4 track
	TRACK_SFX_FM5,		// SFX FM Channel 5 track
	TRACK_SFX_PSG1,		// SFX PSG Channel 1 track
	TRACK_SFX_PSG2,		// SFX PSG Channel 2 track
	TRACK_SFX_PSG3,		// SFX PSG Channel 3 track

	TRACK_TOTAL
};


enum PLAYCTL_BITS
{
	// Bits defined for the "playback_control" byte of smps_track
	PLAY_ATREST			= 0x02,	// track is at rest
	PLAY_SFXOVERRIDE	= 0x04, // SFX is overriding this track
	PLAY_MODULATIONON	= 0x08,	// Modulation turned on
	PLAY_NOATTACK		= 0x10,	// do not attack next note
	PLAY_ISPLAYING		= 0x80,	// track is playing
};


enum VOICECTL_BITS
{
	// Bits defined for the "voice control" byte of smps_track
	// NOTE: Theses bits of "voice_control" are for FM/PSG channel 
	// assignments, so you really can't add any other bits here...
	// They're really only used in code for clarity only.
	VOICE_FM1			= 0x04,	// Assigned to FM1 (Channels 4-6) vs FM) (Channels 1-3)
	VOICE_ISPSG_TRACK	= 0x80	// This track uses the PSG
};


//////////////////////////////////////////////////////////////////////
// SMPS PLAYER MEMORY -- contains various variables used by player;
// basically a subset of what is known as "zComRange" in Sonic 2 Z80
//////////////////////////////////////////////////////////////////////

// This more or less reflects the Z80 "zComRange", sans
// variables that do not apply here.
#define FADE_LEVELS			40	// Volume levels to decrease before fade in/out complete
#define FADEOUT_TICKRESET	3	// Fade-out runs this many frames before decrementing fade level
#define FADEIN_TICKRESET	2	// Fade-in runs this many frames before decrementing fade level (little faster than fade-out)
static struct _smps_data
{
	u8	sfx_priority;		// 00
	u8	tempo_clock;		// 01 Current count for tempo; every overflow causes music update
	u8	tempo;				// 02 Actual current tempo
	u8	pause_mode;			// 03
	
	u8	vol_fadeout;		// 04 total volume levels to continue decreasing volume before fade out considered complete (starts at FADE_LEVELS, works downward)
	u8	vol_fadeouttick;	// 05 delay ticker before next volume decrease (reset to FADEOUT_TICKRESET whenever it hits zero)
	u8	unused_06;			// 06
	u8	DACupdating;		// 07
	
	u8	SoundRequest;		// 08
	u8	queueSFX;			// 09
	u8	queueSFXstereo;		// 0A
	u8	queueSFXunknown;	// 0B
	
	voice *voice_table;		// 0C Offset to common music voice table
	u8	fadein_flag;		// 0E Set while fading in (disabling SFX)
	u8	vol_fadeintick;		// 0F delay ticker before next volume increase (reset to FADEIN_TICKRESET whenever it hits zero)
	u8	vol_fadein;			// 10 total volume levels to continue increasing volume before fade in considered complete
	
	u8	oneUp_flag;			// 11 Flag for when 1-up song is playing (disables sounds)
	u8	main_tempo;			// 12
	u8	speedshoe_backup;	// 13
	u8	speedshoe_tempo;	// 14 Speed shoes tempo
	
	u8	DAC_enabled;		// 15 Set when DAC is in use
	u8	unused;				// 16 "deleted index hold that enabled the secondary bank"
	u8	PAL_flag;			// 17
	// -> 18 bytes
	
	
	// Stuff not part of zComRange
	u8	DAC_on;				// not in Z80 source (but something similar must be in the Sonic 1 driver)
	s8	SpindashKeyOffset;		// Offset value for spindash (set by smps_sfx_setspindashfreq)
	u8  SpindashPlayingCounter;	// Decrements to zero to change spindash sound rate
	struct smps_settings smps_set;
	struct smps_settings smps_sfx_set[TRACK_TOTAL-MUSIC_TRACK_TOTAL];
	const u8 *smps_start;		// Pointer to start of current music data (didn't exist in Z80; only absolute addressing in use)
	const u8 *smps_sfx_track_starts[TRACK_TOTAL-MUSIC_TRACK_TOTAL];		// Pointers for each track of SFX that dictates their start-of-data
}	smps_data,		// Main player memory
	smps_backup;	// Backup memory (when 1-up plays)


//////////////////////////////////////////////////////////////////////
// SMPS TRACK DEFINITIONS -- defines the tracks' memory, which 
// includes both music, SFX, and backup of the music tracks
